# Python | Pandas DataFrame #

Pandas DataFrame is two-dimensional size-mutable, potentially heterogeneous tabular data structure with labeled axes (rows and columns). A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. Pandas DataFrame consists of three principal components, the data, rows, and columns.
<img src="https://media.geeksforgeeks.org/wp-content/uploads/20200225170602/pandas-dataframe.png
" alt="drawing" style="width:500px;"/>




A Dataframe is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. In dataframe datasets arrange in rows and columns, we can store any number of datasets in a dataframe. We can perform many operations on these datasets like arithmetic operation, columns/rows selection, columns/rows addition etc. 

<img src="https://media.geeksforgeeks.org/wp-content/cdn-uploads/creating_dataframe1.png
" alt="drawing" style="width:500px;"/>

# Creating a Pandas DataFrame #
In the real world, a Pandas DataFrame will be created by loading the datasets from existing storage, storage can be SQL Database, CSV file, and Excel file. Pandas DataFrame can be created from the lists, dictionary, and from a list of dictionary etc. Dataframe can be created in different ways here are some ways by which we create a dataframe:

Creating a dataframe using List: DataFrame can be created using a single list or a list of lists.

In [34]:
# import pandas as pd
import pandas as pd

# list of strings
lst = ['Flex', 'had', 'sth', 'really',
			'kekw', 'lmao', 'asdas']

 
# Calling DataFrame constructor on list
df = pd.DataFrame(lst)
print(df)

        0
0    Flex
1     had
2     sth
3  really
4    kekw
5    lmao
6   asdas


 
Creating DataFrame from dict of ndarray/lists: \
To create DataFrame from dict of narray/list, all the narray must be of same length. If index is passed then the length index should be equal to the length of arrays. If no index is passed, then by default, index will be range(n) where n is the array length.

In [21]:
# Python code demonstrate creating 
# DataFrame from dict narray / lists 
# By default addresses.
 
 
# intialise data of lists.
data = {'Name':['Tom', 'nick', 'krish', 'jack'],
        'Age':[20, 21, 19, 18]}
 
# Create DataFrame
df = pd.DataFrame(data)
 
# Print the output.
print(df)

    Name  Age
0    Tom   20
1   nick   21
2  krish   19
3   jack   18

# Dealing with Rows and Columns # 
A Data frame is a two-dimensional data structure, i.e., data is aligned in a tabular fashion in rows and columns. We can perform basic operations on rows/columns like selecting, deleting, adding, and renaming.

Column Selection: In Order to select a column in Pandas DataFrame, we can either access the columns by calling them by their columns name.

In [22]:
# Import pandas package
import pandas as pd
import numpy as np
# Define a dictionary containing employee data
data = {'Name':['Jai', 'Princi', 'Gaurav', 'Anuj'],
        'Age':[27, 24, 22, 32],
        'Address':['Delhi', 'Kanpur', 'Allahabad', 'Kannauj'],
        'Qualification':['Msc', 'MA', 'MCA', 'Phd']}
 
# Convert the dictionary into DataFrame 
df = pd.DataFrame(data)
 
# select two columns
print(df[['Name', 'Qualification']])

     Name Qualification
0     Jai           Msc
1  Princi            MA
2  Gaurav           MCA
3    Anuj           Phd


 
Row Selection: Pandas provide a unique method to retrieve rows from a Data frame. DataFrame.loc[] method is used to retrieve rows from Pandas DataFrame. Rows can also be selected by passing integer location to an iloc[] function.

In [23]:
# importing pandas package
import pandas as pd
 
# making data frame from csv file
data = pd.read_csv("D:/Python/input/nba.csv", index_col ="Name")
 
# retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]
 
 
print(first, "\n\n\n", second)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

# Indexing and Selecting Data #
Indexing in pandas means simply selecting particular rows and columns of data from a DataFrame. Indexing could mean selecting all the rows and some of the columns, some of the rows and all of the columns, or some of each of the rows and columns. Indexing can also be known as Subset Selection.

Indexing a Dataframe using indexing operator [] :
Indexing operator is used to refer to the square brackets following an object. The .loc and .iloc indexers also use the indexing operator to make selections. In this indexing operator to refer to df[].

# Selecting a single columns # 
In order to select a single column, we simply put the name of the column in-between the brackets

# Indexing a DataFrame using .loc[ ] : #
This function selects data by the label of the rows and columns. The df.loc indexer selects data in a different way than just the indexing operator. It can select subsets of rows or columns. It can also simultaneously select subsets of rows and columns.

# Selecting a single row  #
In order to select a single row using .loc[], we put a single row label in a .loc function.

In [24]:

# retrieving row by loc method
first = data.loc["Avery Bradley"]
second = data.loc["R.J. Hunter"]
 
 
print(first, "\n\n\n", second)

Team        Boston Celtics
Number                 0.0
Position                PG
Age                   25.0
Height                 6-2
Weight               180.0
College              Texas
Salary           7730337.0
Name: Avery Bradley, dtype: object


 Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

In [25]:

# retrieving rows by iloc method 
row2 = data.iloc[3] 
 
 
 
print(row2)

Team        Boston Celtics
Number                28.0
Position                SG
Age                   22.0
Height                 6-5
Weight               185.0
College      Georgia State
Salary           1148640.0
Name: R.J. Hunter, dtype: object

 ## Working with Missing Data ##
Missing Data can occur when no information is provided for one or more items or for a whole unit. Missing Data is a very big problem in real life scenario. Missing Data can also refer to as NA(Not Available) values in pandas.

Checking for missing values using isnull() and notnull() :

In order to check missing values in Pandas DataFrame, we use a function isnull() and notnull(). Both function help in checking whether a value is NaN or not. These function can also be used in Pandas Series in order to find null values in a series.

In [26]:

 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from list
df = pd.DataFrame(dict)
 
# using isnull() function  
df.isnull()

   First Score  Second Score  Third Score
0        False         False         True
1        False         False        False
2         True         False        False
3        False          True        False


# Filling missing values using fillna(), replace() and interpolate() : # 
In order to fill null values in a datasets, we use fillna(), replace() and interpolate() function these function replace NaN values with some value of their own. All these function help in filling a null values in datasets of a DataFrame. Interpolate() function is basically used to fill NA values in the dataframe but it uses various interpolation technique to fill the missing values rather than hard-coding the value.

In [27]:

# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, 45, 56, np.nan],
        'Third Score':[np.nan, 40, 80, 98]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
 
# filling missing value using fillna()  
df.fillna(0)

   First Score  Second Score  Third Score
0        100.0          30.0          0.0
1         90.0          45.0         40.0
2          0.0          56.0         80.0
3         95.0           0.0         98.0

  
# Dropping missing values using dropna() : #
In order to drop a null values from a dataframe, we used dropna() function this fuction drop Rows/Columns of datasets with Null values in different ways.

In [28]:
# importing pandas as pd
import pandas as pd
 
# importing numpy as np
import numpy as np
 
# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
   
df

   First Score  Second Score  Third Score  Fourth Score
0        100.0          30.0           52           NaN
1         90.0           NaN           40           NaN
2          NaN          45.0           80           NaN
3         95.0          56.0           98          65.0

In [29]:

# dictionary of lists
dict = {'First Score':[100, 90, np.nan, 95],
        'Second Score': [30, np.nan, 45, 56],
        'Third Score':[52, 40, 80, 98],
        'Fourth Score':[np.nan, np.nan, np.nan, 65]}
 
# creating a dataframe from dictionary
df = pd.DataFrame(dict)
 
# using dropna() function  
df.dropna()

   First Score  Second Score  Third Score  Fourth Score
3         95.0          56.0           98          65.0

# Iterating over rows and columns #
Iteration is a general term for taking each item of something, one after another. Pandas DataFrame consists of rows and columns so, in order to iterate over dataframe, we have to iterate a dataframe like a dictionary.


Iterating over rows : \
In order to iterate over rows, we can use three function iteritems(), iterrows(), itertuples() . These three function will help in iteration over rows.

In [30]:

# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

Now we apply iterrows() function in order to get a each element of rows.

In [31]:

  
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
 
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
# iterating over rows using iterrows() function 
for i, j in df.iterrows():
    print(i, j)
    print()

0 name      aparna
degree       MBA
score         90
Name: 0, dtype: object

1 name      pankaj
degree       BCA
score         40
Name: 1, dtype: object

2 name      sudhir
degree    M.Tech
score         80
Name: 2, dtype: object

3 name      Geeku
degree      MBA
score        98
Name: 3, dtype: object

 
Iterating over Columns : \
In order to iterate over columns, we need to create a list of dataframe columns and then iterating through that list to pull out the dataframe columns.

In [32]:
# importing pandas as pd
import pandas as pd
   
# dictionary of lists
dict = {'name':["aparna", "pankaj", "sudhir", "Geeku"],
        'degree': ["MBA", "BCA", "M.Tech", "MBA"],
        'score':[90, 40, 80, 98]}
  
# creating a dataframe from a dictionary 
df = pd.DataFrame(dict)
 
print(df)

     name  degree  score
0  aparna     MBA     90
1  pankaj     BCA     40
2  sudhir  M.Tech     80
3   Geeku     MBA     98

Now we iterate through columns in order to iterate through columns we first create a list of dataframe columns and then iterate through list.

In [33]:
# creating a list of dataframe columns
columns = list(df)
 
for i in columns:
 
    # printing the third element of the column
    print (df[i][2])

sudhir
M.Tech
80

<table class="dataframe-table"><tbody><tr><th style="background-color:gray">Function</th><th style="background-color:gray">Description</th></tr><tr><td><strong>index()</strong></td><td>Method returns index (row labels) of the DataFrame</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-insert/" rel="noopener" target="_blank">insert()</a></strong></td><td>Method inserts a column into a DataFrame</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-add/" rel="noopener" target="_blank">add()</a></strong></td><td>Method returns addition of dataframe and other, element-wise (binary operator add)</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-sub/" rel="noopener" target="_blank">sub()</a></strong></td><td>Method returns subtraction of dataframe and other, element-wise (binary operator sub)</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-mul/" rel="noopener" target="_blank">mul()</a></strong></td><td>Method returns multiplication of dataframe and other, element-wise (binary operator mul)</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-div/" rel="noopener" target="_blank">div()</a></strong></td><td>Method returns floating division of dataframe and other, element-wise (binary operator truediv)</td></tr><tr><td><strong>unique()</strong></td><td>Method extracts the unique values in the dataframe</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-nunique/" rel="noopener" target="_blank">nunique()</a></strong></td><td>Method returns count of the unique values in the dataframe</td></tr><tr><td><strong>value_counts()</strong></td><td>Method counts the number of times each unique value occurs within the Series</td></tr><tr><td><strong>columns()</strong></td><td>Method returns the column labels of the DataFrame</td></tr><tr><td><strong>axes()</strong></td><td>Method returns a list representing the axes of the DataFrame</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-isnull-and-notnull/" rel="noopener" target="_blank">isnull()</a></strong></td><td>Method creates a Boolean Series for extracting rows with null values</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-isnull-and-notnull/" rel="noopener" target="_blank">notnull()</a></strong></td><td>Method creates a Boolean Series for extracting rows with non-null values</td></tr><tr><td><strong>between()</strong></td><td>Method extracts rows where a column value falls in between a predefined range</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-isin/" rel="noopener" target="_blank">isin()</a></strong></td><td>Method extracts rows from a DataFrame where a column value exists in a predefined collection</td></tr><tr><td><strong>dtypes()</strong></td><td>Method returns a Series with the data type of each column. The result’s index is the original DataFrame’s columns</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-astype/" rel="noopener" target="_blank">astype()</a></strong></td><td>Method converts the data types in a Series</td></tr><tr><td><strong>values()</strong></td><td>Method returns a Numpy representation of the DataFrame i.e. only the values in the DataFrame will be returned, the axes labels will be removed</td></tr><tr><td><strong>sort_values()- <a href="https://www.geeksforgeeks.org/python-pandas-dataframe-sort_values-set-1/" rel="noopener" target="_blank">Set1</a>, <a href="https://www.geeksforgeeks.org/python-pandas-dataframe-sort_values-set-2/" rel="noopener" target="_blank">Set2</a></strong></td><td>Method sorts a data frame in Ascending or Descending order of passed Column</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-sort_index/" rel="noopener" target="_blank">sort_index()</a></strong></td><td>Method sorts the values in a DataFrame based on their index positions or labels instead of their values but sometimes a data frame is made out of two or more data frames and hence later index can be changed using this method</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-extracting-rows-using-loc/" rel="noopener" target="_blank">loc[]</a></strong></td><td>Method retrieves rows based on index label</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-extracting-rows-using-pandas-iloc/" rel="noopener" target="_blank">iloc[]</a></strong></td><td>Method retrieves rows based on index position</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-ix/" rel="noopener" target="_blank">ix[]</a></strong></td><td>Method retrieves DataFrame rows based on either index label or index position. This method combines the best features of the .loc[] and .iloc[] methods</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-rename/" rel="noopener" target="_blank">rename()</a></strong></td><td>Method is called on a DataFrame to change the names of the index labels or column names</td></tr><tr><td><strong>columns()</strong></td><td>Method is an alternative attribute to change the coloumn name</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-delete-rows-columns-from-dataframe-using-pandas-drop/" rel="noopener" target="_blank">drop()</a></strong></td><td>Method is used to delete rows or columns from a DataFrame</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-pop/" rel="noopener" target="_blank">pop()</a></strong></td><td>Method is used to delete rows or columns from a DataFrame</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-sample/" rel="noopener" target="_blank">sample()</a></strong></td><td>Method pulls out a random sample of rows or columns from a DataFrame</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-nsmallest/" rel="noopener" target="_blank">nsmallest()</a></strong></td><td>Method pulls out the rows with the smallest values in a column</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-nlargest/" rel="noopener" target="_blank">nlargest()</a></strong></td><td>Method pulls out the rows with the largest values in a column</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-df-size-df-shape-and-df-ndim/" rel="noopener" target="_blank">shape()</a></strong></td><td>Method returns a tuple representing the dimensionality of the DataFrame</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-df-size-df-shape-and-df-ndim/" rel="noopener" target="_blank">ndim()</a></strong></td><td>Method returns an ‘int’ representing the number of axes / array dimensions.<br>Returns 1 if Series, otherwise returns 2 if DataFrame</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-dropna/" rel="noopener" target="_blank">dropna()</a></strong></td><td>Method allows the user to analyze and drop Rows/Columns with Null values in different ways</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-fillna-to-replace-null-values-in-dataframe/" rel="noopener" target="_blank">fillna()</a></strong></td><td>Method manages and let the user replace NaN values with some value of their own</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-rank/" rel="noopener" target="_blank">rank()</a></strong></td><td>Values in a Series can be ranked in order with this method</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-filtering-data-with-pandas-query-method/" rel="noopener" target="_blank">query()</a></strong></td><td>Method is an alternate string-based syntax for extracting a subset from a DataFrame</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-difference-between-pandas-copy-and-copying-through-variables/" rel="noopener" target="_blank">copy()</a></strong></td><td>Method creates an independent copy of a pandas object</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-duplicated/" rel="noopener" target="_blank">duplicated()</a></strong></td><td>Method creates a Boolean Series and uses it to extract rows that have duplicate values</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-drop_duplicates/" rel="noopener" target="_blank">drop_duplicates()</a></strong></td><td>Method is an alternative option to identifying duplicate rows and removing them through filtering</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-set_index/" rel="noopener" target="_blank">set_index()</a></strong></td><td>Method sets the DataFrame index (row labels) using one or more existing columns</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-reset_index/" rel="noopener" target="_blank">reset_index()</a></strong></td><td>Method resets index of a Data Frame. This method sets a list of integer ranging from 0 to length of data as index</td></tr><tr><td><strong><a href="https://www.geeksforgeeks.org/python-pandas-dataframe-where/" rel="noopener" target="_blank">where()</a></strong></td><td>Method is used to check a Data Frame for one or more condition and return the result accordingly. By default, the rows not satisfying the condition are filled with NaN value</td></tr></tbody></table>

## Pandas Dataframe/Series.head() method ## 

Example #1:

In this example, top 5 rows of data frame are returned and stored in a new variable. No parameter is passed to .head() method since by default it is 5.

In [35]:


# calling head() method
# storing in new variable
data_top = data.head()

# display
data_top

,Team,Number,Position,Age,Height,Weight,College,Salary
Name,,,,,,,,
Avery Bradley,Boston Celtics,0.0,PG,25.0,6-2,180.0,Texas,7730337.0
Jae Crowder,Boston Celtics,99.0,SF,25.0,6-6,235.0,Marquette,6796117.0
John Holland,Boston Celtics,30.0,SG,27.0,6-5,205.0,Boston University,NaN
R.J. Hunter,Boston Celtics,28.0,SG,22.0,6-5,185.0,Georgia State,1148640.0
Jonas Jerebko,Boston Celtics,8.0,PF,29.0,6-10,231.0,NaN,5000000.0

Example #2: Calling on Series with n parameter()

In this example, the .head() method is called on series with custom input of n parameter to return top 9 rows of the series.

In [38]:
# number of rows to return
n = 9
data = pd.read_csv("D:/Python/input/nba.csv")
# creating series
series = data["Name"]

# returning top n rows
top = series.head(n = n)

# display
top

0    Avery Bradley
1      Jae Crowder
2     John Holland
3      R.J. Hunter
4    Jonas Jerebko
5     Amir Johnson
6    Jordan Mickey
7     Kelly Olynyk
8     Terry Rozier
Name: Name, dtype: object

# Pandas Dataframe.describe() method #

Pandas describe() is used to view some basic statistical details like percentile, mean, std etc. of a data frame or a series of numeric values. When this method is applied to a series of string, it returns a different output which is shown in the examples below.

Syntax: DataFrame.describe(percentiles=None, include=None, exclude=None)

Parameters:
percentile: list like data type of numbers between 0-1 to return the respective percentile
include: List of data types to be included while describing dataframe. Default is None
exclude: List of data types to be Excluded while describing dataframe. Default is None

Return type: Statistical summary of data frame.

In [39]:
# importing regex module
import re
	
	
# removing null values to avoid errors
data.dropna(inplace = True)

# percentile list
perc =[.20, .40, .60, .80]

# list of dtypes to include
include =['object', 'float', 'int']

# calling describe method
desc = data.describe(percentiles = perc, include = include)

# display
desc

,Name,Team,Number,Position,Age,Height,Weight,College,Salary
count,364,364,364.000000,364,364.000000,364,364.000000,364,3.640000e+02
unique,364,30,NaN,5,NaN,17,NaN,115,NaN
top,Jahlil Okafor,New Orleans Pelicans,NaN,SG,NaN,6-9,NaN,Kentucky,NaN
freq,1,16,NaN,87,NaN,49,NaN,22,NaN
mean,NaN,NaN,16.829670,NaN,26.615385,NaN,219.785714,NaN,4.620311e+06
std,NaN,NaN,14.994162,NaN,4.233591,NaN,24.793099,NaN,5.119716e+06
min,NaN,NaN,0.000000,NaN,19.000000,NaN,161.000000,NaN,5.572200e+04
20%,NaN,NaN,4.000000,NaN,23.000000,NaN,195.000000,NaN,9.472760e+05
40%,NaN,NaN,9.000000,NaN,25.000000,NaN,212.000000,NaN,1.638754e+06
50%,NaN,NaN,12.000000,NaN,26.000000,NaN,220.000000,NaN,2.515440e+06
60%,NaN,NaN,17.000000,NaN,27.000000,NaN,228.000000,NaN,3.429934e+06
80%,NaN,NaN,30.000000,NaN,30.000000,NaN,242.400000,NaN,7.838202e+06
max,NaN,NaN,99.000000,NaN,40.000000,NaN,279.000000,NaN,2.287500e+07

 
Example #2: Describing series of strings

In this example, the describe method is called by the Name column to see the behaviour with object data type.

In [41]:

	
# removing null values to avoid errors
data.dropna(inplace = True)

# calling describe method
desc = data["Name"].describe()

# display
desc

count               364
unique              364
top       Jahlil Okafor
freq                  1
Name: Name, dtype: object